{
  "EXPERIENCE": "Professional Experience",
  "MENU_ABOUT_ME": "About me",
  "MENU_EXPERIENCE": "Experience",
  "MENU_PROJECTS": "Projects",
  "MENU_CONTACT": "Contact",
  "HOME_SUBTITLE": "Senior Full Stack Developer • Tech Lead • Systems Analyst",
  "HOME_CONTACT": "Contact me",
  "HOME_DOWNLOAD_CV": "Download CV",
  "ABOUT": "Professional Profile",
  "ABOUT_DESC_1": "Full Stack Developer with over 5 years of professional experience and a self-taught development background of more than 10 years through personal projects, in the design, evolution and modernization of critical web and mobile applications for multiple companies and thousands of users. Results-driven, with a focus on code quality, operational efficiency and continuous improvement.",
  "ABOUT_DESC_2": "Expert in Angular (JS and 2+ up to v20), React, Node.js, PHP, Ionic, Cloud (Azure and Cloudflare R2) and CI/CD, with a proven track record in technology migrations, legacy system modernization and deploy automation. Strong command of MySQL and relational database design and normalization.",
  "ABOUT_DESC_3": "Technical team leadership, architecture definition, demand prioritization and coordination with DevOps, QA and support, ensuring high availability (>95%) and reduction of recurring incidents (50%) in production.",
  "ABOUT_DESC_4": "Academic background and languages: Systems Analyst graduated in 2020, with a GPA of 8/10. Native Spanish speaker, with advanced Portuguese proficiency oriented to professional technical use and intermediate level of English.",
  "CESLA_TECH_LEAD": "Tech Lead / Full Stack Developer",
  "CESLA_TECH_LEAD_PERIOD": "Nov 2024 – Feb 2026",
  "CESLA_TECH_LEAD_RESPONSIBILITY_1": "Led a full stack team of 3 developers in the maintenance and evolution of 2 web applications, 5 mobile apps and 5 APIs, used by 40 clients and thousands of users, ensuring sustained availability >95%.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_2": "Defined technical strategy, initiative prioritization and cross-functional coordination with DevOps, QA and Support, accelerating incident resolution and optimizing delivery processes.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_3": "Designed and executed a storage migration from Azure Blob Storage to Cloudflare R2, achieving a 50% reduction in traffic costs with no production impact.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_4": "Led the technological modernization of mobile apps by migrating from Ionic 3 to Ionic 8, including refactoring and dependency updates, improving platform maintainability and extensibility.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_5": "Implemented CI/CD pipelines, reducing deployment time from up to 1 hour to 5 minutes, increasing release frequency to 4–6 per month.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_6": "Automated build and distribution processes on Firebase and app stores, reducing build generation time from half a day to 5 minutes and eliminating configuration errors.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_7": "Supervised code quality, security and performance through code reviews and dependency management, contributing to 50% fewer recurring incidents.",
  "CESLA_FULLSTACK": "Full Stack Developer",
  "CESLA_FULLSTACK_PERIOD": "May 2021 – Nov 2024",
  "CESLA_FULLSTACK_RESPONSIBILITY_1": "Maintained and evolved full stack features in ReactJS, PHP and JavaScript, delivering an average of 10 features and bug fixes per 2-week sprint for 40 clients and thousands of users.",
  "CESLA_FULLSTACK_RESPONSIBILITY_2": "Participated in technical architecture definition and solution design, optimizing scalability and maintainability of legacy systems and new products.",
  "CESLA_FULLSTACK_RESPONSIBILITY_3": "Modernized legacy systems through component refactoring and modularization, achieving a 60% reduction in code size.",
  "CESLA_FULLSTACK_RESPONSIBILITY_4": "Maintained 5 hybrid mobile applications with Ionic, integrating native plugins and Android/iOS support, ensuring consistency across devices and environments.",
  "CESLA_FULLSTACK_RESPONSIBILITY_5": "Implemented offline-first architecture with data synchronization, enabling continuous operation in connectivity-free environments.",
  "CESLA_FULLSTACK_RESPONSIBILITY_6": "Managed file storage on Azure Blob Storage, optimizing efficiency and reducing complexity in data access.",
  "APEX_FRONTEND": "Front-End Developer",
  "APEX_FRONTEND_PERIOD": "Jan 2020 – Mar 2021",
  "APEX_FRONTEND_RESPONSIBILITY_1": "Maintained dynamic interfaces with AngularJS, JavaScript, HTML5 and CSS3, ensuring consistent user experience and cross-browser compatibility in high-volume applications.",
  "APEX_FRONTEND_RESPONSIBILITY_2": "Implemented client-configurable conversational flows within a multi-tenant architecture, enabling fast and customized adaptations for multiple clients.",
  "APEX_FRONTEND_RESPONSIBILITY_3": "Collaborated on debugging and resolution of critical incidents, contributing to product stability and operational continuity.",
  "APEX_FRONTEND_RESPONSIBILITY_4": "Participated in code reviews and promoted front-end development best practices, improving code quality and facilitating product evolution.",
  "RESPONSIBILITIES": "Responsibilities & Achievements",
  "PROJECTS": "Personal Projects",
  "PROJECT_NURA_TITLE": "Multilingual technical portfolio",
  "PROJECT_NURA_SUBTITLE": "Technical positioning platform",
  "PROJECT_NURA_DESC": "Nura is a technical SPA portfolio built with Angular 21 using standalone architecture (no NgModule), runtime internationalization in three languages (ES/EN/PT) and automated static deployment on GitHub Pages. Centralizes profile, experience and projects with language-specific CV access, aimed at recruiters and clients.",
  "PROJECT_NURA_KPI_1": "i18n languages",
  "PROJECT_NURA_KPI_2": "Test suites",
  "PROJECT_NURA_KPI_3": "CI/CD automations",
  "PROJECT_OCTOAUTODRIVE_TITLE": "Automotive SaaS platform",
  "PROJECT_OCTOAUTODRIVE_SUBTITLE": "Multi-tenant full stack operational management",
  "PROJECT_OCTOAUTODRIVE_DESC": "AutoDrive is a multi-tenant SaaS platform for automotive operational management: vehicle inventory, Facebook publishing, role-based access and field-level change auditing. Stack Angular 13 + Node.js/Express + MySQL, with Cloudinary, Facebook Graph API and Gmail OAuth2 integrations. Frontend with lazy loading, trilingual i18n and real-time updates via Socket.IO.",
  "PROJECT_OCTOAUTODRIVE_KPI_1": "API modules",
  "PROJECT_OCTOAUTODRIVE_KPI_2": "External integrations",
  "PROJECT_OCTOAUTODRIVE_KPI_3": "i18n languages",
  "PROJECT_OILGROUP_TITLE": "Distribution commerce platform",
  "PROJECT_OILGROUP_SUBTITLE": "End-to-end full stack operational management",
  "PROJECT_OILGROUP_DESC": "OilGroup is a platform for end-to-end commercial management of a distributor: inventory with stock traceability, state-based sales flow, collections, supplier payments and operational licenses. Includes a metrics dashboard with amCharts and PDF report export. Stack Angular 11 + Node.js/Express + MySQL.",
  "PROJECT_OILGROUP_KPI_1": "CI/CD environments",
  "PROJECT_OILGROUP_KPI_2": "Business modules",
  "PROJECT_ANGULARJSONFORM_TITLE": "Open source Angular library",
  "PROJECT_ANGULARJSONFORM_SUBTITLE": "Dynamic forms from JSON configuration",
  "PROJECT_ANGULARJSONFORM_DESC": "angular-json-form is an Angular library published on npm that generates dynamic forms from JSON configuration. Supports 15 input types, declarative validations, dynamic field rules, trilingual i18n and configurable theming. Includes a demo app for quick adoption. Stack Angular 13 + TypeScript + RxJS, packaged with ng-packagr and distributed on npm (v1.4.6).",
  "PROJECT_ANGULARJSONFORM_KPI_1": "published on npm",
  "PROJECT_ANGULARJSONFORM_KPI_2": "Input types",
  "PROJECT_ANGULARJSONFORM_KPI_3": "i18n languages",
  "PROJECT_REPOSITORY": "Repository",
  "PROJECT_DEMO": "Demo",
  "CONTACT": "Links & Contact"
}
