{
    "DEVELOPER": "Senior Fullstack Developer | Angular | Ionic | Node.js | Tech Lead",
    "EXPERIENCE": "Professional Experience",
    "MENU_ABOUT_ME": "About me",
    "MENU_EXPERIENCE": "Experience",
    "MENU_SKILLS": "Skills",
    "MENU_CONTACT": "Contact",
    "ABOUT": "PROFESSIONAL PROFILE",
    "ABOUT_DESC": "Tech Lead and Full Stack Developer with over 5 years of experience in the design, evolution, and modernization of critical web and mobile applications for multiple companies and thousands of users. Expert in Angular (JS and 2+ up to v20), React, Node.js, PHP, Ionic, Cloud (Azure and Cloudflare R2), and CI/CD, with a proven track record in technology migrations, legacy system modernization, and deployment automation. Leadership of technical teams, architecture definition, demand prioritization, and coordination with DevOps, QA, and support, ensuring high availability (>95%) and reduction of recurring incidents (50%) in production. Results-oriented, with a focus on code quality, operational efficiency, and continuous improvement.",
    "ABOUT_EDUCATION": "Education and Languages: Systems Analyst degree completed in 2020, with a GPA of 8/10. Native Spanish, advanced Portuguese with professional technical usage, and basic English.",
    "SKILLS": "Core Skills",
    "CESLA_TECH_LEAD": "Tech Lead / Full Stack Developer",
    "CESLA_TECH_LEAD_PERIOD": "Nov 2024 – Feb 2026",
    "CESLA_TECH_LEAD_RESPONSIBILITY_1": "I led a full stack team of 3 developers in the maintenance and evolution of 2 web applications, 5 mobile apps, and 5 APIs, used by 40 clients and thousands of users, ensuring sustained availability >95%.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_2": "I defined the technical strategy, prioritized initiatives, and coordinated cross-functionally with DevOps, QA, and Support, accelerating incident resolution and optimizing delivery processes.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_3": "I designed and executed the migration of storage from Azure Blob Storage to Cloudflare R2, achieving a 50% reduction in traffic costs with no impact on production.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_4": "I led the technological modernization of mobile applications by migrating from Ionic 3 to Ionic 8, including refactoring and dependency updates, improving the platform’s maintainability and extensibility.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_5": "I implemented CI/CD pipelines, reducing deployment time from up to 1 hour to 5 minutes and increasing the release frequency to 4–6 per month.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_6": "I automated build and distribution processes in Firebase and app stores, reducing build generation time from half a day to 5 minutes and eliminating configuration errors.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_7": "I supervised code quality, security, and performance through code reviews and dependency management, contributing to 50% fewer recurring incidents.",
    "CESLA_FULLSTACK": "Full Stack Developer",
    "CESLA_FULLSTACK_PERIOD": "May 2021 – Nov 2024",
    "CESLA_FULLSTACK_RESPONSIBILITY_1": "I maintained and evolved full stack functionalities in ReactJS, PHP, and JavaScript, delivering an average of 10 features and bug fixes per 2-week sprint for 40 clients and thousands of users.",
    "CESLA_FULLSTACK_RESPONSIBILITY_2": "I participated in the definition of technical architecture and solution design, optimizing the scalability and maintainability of legacy systems and new products.",
    "CESLA_FULLSTACK_RESPONSIBILITY_3": "I modernized legacy systems through component refactoring and modularization, achieving a 60% reduction in codebase size.",
    "CESLA_FULLSTACK_RESPONSIBILITY_4": "I maintained 5 hybrid mobile applications with Ionic, integrating native plugins and Android/iOS support, ensuring consistency across devices and environments.",
    "CESLA_FULLSTACK_RESPONSIBILITY_5": "I implemented an offline-first architecture with data synchronization, enabling continuous operation in environments without connectivity.",
    "CESLA_FULLSTACK_RESPONSIBILITY_6": "I managed file storage in Azure Blob Storage, optimizing efficiency and reducing complexity in data access.",
    "APEX_FRONTEND": "Apex America — Front-End Developer",
    "APEX_FRONTEND_PERIOD": "Jan 2020 – Mar 2021",
    "APEX_FRONTEND_RESPONSIBILITY_1": "I maintained dynamic interfaces with AngularJS, JavaScript, HTML5, and CSS3, ensuring a consistent user experience and cross-browser compatibility in high-volume applications.",
    "APEX_FRONTEND_RESPONSIBILITY_2": "I implemented client-configurable conversational flows within a multi-tenant architecture, enabling quick and customized adaptations for multiple clients.",
    "APEX_FRONTEND_RESPONSIBILITY_3": "I collaborated in debugging and resolving critical incidents, contributing to the product’s stability and operational continuity.",
    "APEX_FRONTEND_RESPONSIBILITY_4": "I participated in code reviews and promoted front-end development best practices, improving code quality and facilitating product evolution.",
    "RESPONSIBILITIES": "Responsibilities and achievements",
    "PROJECTS": "Projects",
    "PROJECT_1": "Project 1",
    "PROJECT_1_DESC": "Brief project description.",
    "PROJECT_1_LINK": "View repository",
    "PROJECT_2": "Project 2",
    "PROJECT_2_DESC": "Brief project description.",
    "PROJECT_2_LINK": "View repository",
    "CONTACT": "Links & Contact"
}