{
    "DEVELOPER": "Senior Fullstack Developer | Angular | Ionic | Node.js | Tech Lead",
    "EXPERIENCE": "Professional Experience",
    "MENU_ABOUT_ME": "About me",
    "MENU_EXPERIENCE": "Experience",
    "MENU_SKILLS": "Skills",
    "MENU_CONTACT": "Contact",
    "PROFILE": "PERFIL PROFISSIONAL",
    "PROFILE_TEXT_1": "Tech Lead e Desenvolvedor Full Stack com mais de 5 anos de experiência no design, desenvolvimento e modernização de aplicações web e mobile críticas para múltiplas empresas e milhares de usuários. Especialista em Angular (JS e 2+ até v20), React, Node.js, PHP, Ionic, cloud (Azure e Cloudflare R2) e CI/CD, com histórico comprovado em migrações tecnológicas, modernização de sistemas legados e otimização de desempenho e segurança.",
    "PROFILE_TEXT_2": "Liderança de equipes técnicas, definição de arquitetura, priorização de demandas e coordenação com DevOps, QA e suporte, garantindo alta disponibilidade (95%) e redução de incidentes recorrentes (50%) em produção. Experiência em automação de pipelines, distribuição de aplicativos móveis, integração de APIs e arquiteturas offline-first.",
    "PROFILE_TEXT_3": "Orientado a resultados, com forte foco em qualidade de código, eficiência operacional e melhoria contínua, entregando soluções escaláveis e sustentáveis em ambientes críticos.",
    "PROFILE_TEXT_4": "Education and Languages: Systems Analyst degree completed in 2020, with a GPA of 8/10. Native Spanish, advanced Portuguese with professional technical usage, and basic English.",
    "CESLA_TECH_LEAD": "Tech Lead / Full Stack Developer",
    "CESLA_TECH_LEAD_PERIOD": "Nov 2024 – Feb 2026",
    "CESLA_TECH_LEAD_DESC": "Technical and strategic leadership of multiple critical applications in the industrial safety sector, used by thousands of users in various companies, coordinating technological evolution, architecture modernization and operational stability of the platform.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_1": "Leadership of a full stack team responsible for the evolutionary and corrective maintenance of critical applications.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_2": "Definition of technical strategy, initiative prioritization, and coordination with Support, QA, Implementation, and DevSecOps teams.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_3": "Migration of storage infrastructure from Azure Blob Storage to Cloudflare R2, optimizing costs and architecture.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_4": "Technological modernization through migration from Ionic 3 to Ionic 8, including code refactoring and dependency updates.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_5": "Implementation and automation of CI/CD pipelines for web and mobile applications.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_6": "Automation of build and distribution processes via Firebase App Distribution and publication on Google Play and Apple App Store.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_7": "Supervision of code quality, security, and performance through code reviews, dependency management, and vulnerability control.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_8": "Analysis of production incidents, root cause identification (RCA), and definition of continuous improvement plans.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_9": "Standardization of technical processes and documentation for internal and external audits.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_10": "Active participation in architecture decisions and technological evolution of the platform.",
    "CESLA_TECH_LEAD_RESULT_1": "95% production uptime sustained in critical systems.",
    "CESLA_TECH_LEAD_RESULT_2": "50% reduction in recurring incidents through structural improvements and automation.",
    "CESLA_TECH_LEAD_RESULT_3": "Progressive technological evolution without operational interruptions.",
    "CESLA_TECH_LEAD_RESULT_4": "Increased team efficiency through standardization and CI/CD.",
    "CESLA_FULLSTACK": "Full Stack Developer",
    "CESLA_FULLSTACK_PERIOD": "May 2021 – Nov 2024",
    "CESLA_FULLSTACK_DESC": "Development and evolution of web and mobile applications for the industrial security sector, used by thousands of users from multiple companies, actively participating in technical decisions and solution architecture in critical production environments.",
    "CESLA_FULLSTACK_RESPONSIBILITY_1": "Full stack development of new features using ReactJS, PHP, and JavaScript.",
    "CESLA_FULLSTACK_RESPONSIBILITY_2": "Participation in defining technical architecture and solution design decisions.",
    "CESLA_FULLSTACK_RESPONSIBILITY_3": "Evolution and modernization of existing legacy systems.",
    "CESLA_FULLSTACK_RESPONSIBILITY_4": "Development of 5 hybrid mobile applications with Ionic, including integration with native plugins for device functionalities.",
    "CESLA_FULLSTACK_RESPONSIBILITY_5": "Implementation of offline-first architecture with data synchronization for operation in environments without connectivity.",
    "CESLA_FULLSTACK_RESPONSIBILITY_6": "Integration with internal and third-party APIs, including design and consumption of REST services.",
    "CESLA_FULLSTACK_RESPONSIBILITY_7": "File storage management using Azure Blob Storage.",
    "CESLA_FULLSTACK_RESPONSIBILITY_8": "Configuration and maintenance of mobile builds and deployments for Android and iOS.",
    "CESLA_FULLSTACK_RESPONSIBILITY_9": "Production incident resolution in high-criticality and high-usage systems.",
    "CESLA_FULLSTACK_RESPONSIBILITY_10": "Performance, security, and code quality optimization.",
    "CESLA_FULLSTACK_RESPONSIBILITY_11": "Active participation in code reviews, best practices, and agile methodologies (Scrum).",
    "APEX_FRONTEND": "Apex America — Front-End Developer",
    "APEX_FRONTEND_PERIOD": "Jan 2020 – Mar 2021",
    "APEX_FRONTEND_DESC": "Development and maintenance of the web interface of a customer service chatbot platform used by multiple companies, integrating artificial intelligence services for the management of conversational flows and automation of user interactions in high-concurrency environments.",
    "APEX_FRONTEND_RESPONSIBILITY_1": "Development of dynamic interfaces using AngularJS, JavaScript, HTML5, and CSS3.",
    "APEX_FRONTEND_RESPONSIBILITY_2": "Integration with REST APIs and backend services deployed on AWS to consume AI functionalities and conversation management.",
    "APEX_FRONTEND_RESPONSIBILITY_3": "Implementation of client-configurable conversational flows within a multi-tenant architecture.",
    "APEX_FRONTEND_RESPONSIBILITY_4": "Optimization of performance, usability, and cross-browser compatibility in applications with a large user base.",
    "APEX_FRONTEND_RESPONSIBILITY_5": "Participation in debugging, incident resolution, and continuous product improvement.",
    "APEX_FRONTEND_RESPONSIBILITY_6": "Collaboration with backend and DevOps teams for API contract definition and troubleshooting in cloud environments.",
    "APEX_FRONTEND_RESPONSIBILITY_7": "Active participation in code reviews and agile methodologies (Scrum).",
    "APEX_FRONTEND_RESPONSIBILITY_8": "Application of front-end development best practices and code quality standards.",
    "RESPONSIBILITIES": "Responsibilities and achievements",
    "RESULTS": "Key Results",
    "SKILLS": "Technical Skills",
    "SKILLS_FRONTEND": "Frontend",
    "SKILLS_BACKEND": "Backend",
    "SKILLS_MOBILE": "Mobile",
    "SKILLS_DATABASE": "Database",
    "SKILLS_CLOUD": "Cloud & DevOps",
    "SKILLS_TOOLS": "Tools",
    "SKILLS_METHODOLOGIES": "Methodologies",
    "PROJECTS": "Projects",
    "PROJECT_1": "Project 1",
    "PROJECT_1_DESC": "Brief project description.",
    "PROJECT_1_LINK": "View repository",
    "PROJECT_2": "Project 2",
    "PROJECT_2_DESC": "Brief project description.",
    "PROJECT_2_LINK": "View repository",
    "CONTACT": "Links & Contact"
}