{
  "EXPERIENCE": "Experiencia Profesional",
  "MENU_ABOUT_ME": "Sobre mí",
  "MENU_EXPERIENCE": "Experiencia",
  "MENU_PROJECTS": "Proyectos",
  "MENU_CONTACT": "Contacto",
  "HOME_SUBTITLE": "Desarrollador Full stack Senior • Tech Lead • Analista de Sistemas",
  "HOME_CONTACT": "Contáctame",
  "HOME_DOWNLOAD_CV": "Descargar CV",
  "ABOUT": "Perfil Profesional",
  "ABOUT_DESC_1": "Desarrollador Full Stack con más de 5 años de experiencia profesional y una trayectoria de desarrollo autodidacta de más de 10 años a través de proyectos personales, en diseño, evolución y modernización de aplicaciones web y móviles críticas para múltiples empresas y miles de usuarios. Orientado a resultados, con foco en calidad de código, eficiencia operativa y mejora continua.",
  "ABOUT_DESC_2": "Experto en Angular (JS y 2+ hasta v20), React, Node.js, PHP, Ionic, Cloud (Azure y Cloudflare R2) y CI/CD, con historial comprobado en migraciones tecnológicas, modernización de sistemas legados y automatización de deploy. Sólido manejo de MySQL y diseño/normalización de bases de datos relacionales.",
  "ABOUT_DESC_3": "Liderazgo de equipos técnicos, definición de arquitectura, priorización de demandas y coordinación con DevOps, QA y soporte, garantizando alta disponibilidad (>95 %) y reducción de incidentes recurrentes (50 %) en producción.",
  "ABOUT_DESC_4": "Formación académica e idiomas: Analista de Sistemas graduado en 2020, con un promedio académico de 8/10. Idioma nativo español, con dominio avanzado de portugués orientado al uso técnico profesional y nivel intermediario de inglés.",
  "CESLA_TECH_LEAD": "Tech Lead / Desarrollador Full Stack",
  "CESLA_TECH_LEAD_PERIOD": "Nov 2024 – Feb 2026",
  "CESLA_TECH_LEAD_RESPONSIBILITY_1": "Lideré un equipo full stack de 3 desarrolladores en el mantenimiento y evolución de 2 aplicaciones web, 5 apps móviles y 5 APIs, utilizadas por 40 clientes y miles de usuarios, asegurando disponibilidad sostenida >95 %.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_2": "Definí estrategia técnica, priorización de iniciativas y coordinación cross-functional con DevOps, QA y Soporte, acelerando resolución de incidencias y optimizando procesos de entrega.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_3": "Diseñé y ejecuté la migración de almacenamiento de Azure Blob Storage a Cloudflare R2, logrando reducción de costos de tráfico en 50 % sin impacto en producción.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_4": "Lideré la modernización tecnológica de apps móviles migrando de Ionic 3 a Ionic 8, incluyendo refactorización y actualización de dependencias, mejorando mantenibilidad y extensibilidad de la plataforma.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_5": "Implementé pipelines CI/CD, reduciendo el tiempo de despliegue de hasta 1 hora a 5 minutos, aumentando la frecuencia de releases a 4–6 por mes.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_6": "Automatizé procesos de build y distribución en Firebase y stores, reduciendo el tiempo de generación de builds de medio día a 5 minutos y eliminando errores de configuración.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_7": "Supervisé calidad de código, seguridad y performance mediante code reviews y gestión de dependencias, contribuyendo a 50 % menos incidentes recurrentes.",
  "CESLA_FULLSTACK": "Desarrollador Full Stack",
  "CESLA_FULLSTACK_PERIOD": "May 2021 – Nov 2024",
  "CESLA_FULLSTACK_RESPONSIBILITY_1": "Mantuve y evolucioné funcionalidades full stack en ReactJS, PHP y JavaScript, entregando en promedio 10 features y bugs por sprint de 2 semanas para 40 clientes y miles de usuarios.",
  "CESLA_FULLSTACK_RESPONSIBILITY_2": "Participé en la definición de arquitectura técnica y diseño de soluciones, optimizando la escalabilidad y mantenibilidad de sistemas legacy y nuevos productos.",
  "CESLA_FULLSTACK_RESPONSIBILITY_3": "Modernicé sistemas legacy mediante refactorización y modularización de componentes, logrando reducción del 60 % del tamaño del código.",
  "CESLA_FULLSTACK_RESPONSIBILITY_4": "Mantuve 5 aplicaciones móviles híbridas con Ionic, integrando plugins nativos y soporte Android/iOS, garantizando consistencia entre dispositivos y entornos.",
  "CESLA_FULLSTACK_RESPONSIBILITY_5": "Implementé arquitectura offline-first con sincronización de datos, permitiendo operación continua en entornos sin conectividad.",
  "CESLA_FULLSTACK_RESPONSIBILITY_6": "Gestioné almacenamiento de archivos en Azure Blob Storage, optimizando eficiencia y reduciendo complejidad en acceso a datos.",
  "APEX_FRONTEND": "Desarrollador Front-End",
  "APEX_FRONTEND_PERIOD": "Ene 2020 – Mar 2021",
  "APEX_FRONTEND_RESPONSIBILITY_1": "Mantuve interfaces dinámicas con AngularJS, JavaScript, HTML5 y CSS3, asegurando experiencia de usuario consistente y compatibilidad cross-browser en aplicaciones de alto volumen.",
  "APEX_FRONTEND_RESPONSIBILITY_2": "Implementé flujos conversacionales configurables por cliente dentro de una arquitectura multi-tenant, permitiendo adaptaciones rápidas y personalizadas para múltiples clientes.",
  "APEX_FRONTEND_RESPONSIBILITY_3": "Colaboré en debugging y resolución de incidencias críticas, contribuyendo a la estabilidad y continuidad operativa del producto.",
  "APEX_FRONTEND_RESPONSIBILITY_4": "Participé en code reviews y promoví buenas prácticas de desarrollo front-end, mejorando la calidad del código y facilitando la evolución del producto.",
  "RESPONSIBILITIES": "Responsabilidades y logros",
  "PROJECTS": "Proyectos personales",
  "PROJECT_NURA_TITLE": "Portfolio técnico multilingüe",
  "PROJECT_NURA_SUBTITLE": "Plataforma de posicionamiento técnico",
  "PROJECT_NURA_DESC": "Nura es un portfolio técnico SPA desarrollado en Angular 21 con arquitectura standalone (sin NgModule), internacionalización runtime en tres idiomas (ES/EN/PT) y despliegue estático automatizado en GitHub Pages. Centraliza perfil, experiencia y proyectos con acceso a CV por idioma, orientado a recruiters y clientes.",
  "PROJECT_NURA_KPI_1": "Idiomas i18n",
  "PROJECT_NURA_KPI_2": "Suites de test",
  "PROJECT_NURA_KPI_3": "Automatizaciones en CI/CD",
  "PROJECT_OCTOAUTODRIVE_TITLE": "Plataforma SaaS automotriz",
  "PROJECT_OCTOAUTODRIVE_SUBTITLE": "Gestión operativa multi-tenant full stack",
  "PROJECT_OCTOAUTODRIVE_DESC": "AutoDrive es una plataforma SaaS multi-tenant para gestión operativa automotriz: inventario de vehículos, publicación a Facebook, roles y auditoría de cambios a nivel campo. Stack Angular 13 + Node.js/Express + MySQL, con integración de Cloudinary, Facebook Graph API y Gmail OAuth2. Frontend con lazy loading, i18n trilingüe y tiempo real vía Socket.IO.",
  "PROJECT_OCTOAUTODRIVE_KPI_1": "Módulos API",
  "PROJECT_OCTOAUTODRIVE_KPI_2": "Integraciones externas",
  "PROJECT_OCTOAUTODRIVE_KPI_3": "Idiomas i18n",
  "PROJECT_OILGROUP_TITLE": "Plataforma comercial de distribución",
  "PROJECT_OILGROUP_SUBTITLE": "Gestión operativa full stack end-to-end",
  "PROJECT_OILGROUP_DESC": "OilGroup es una plataforma para gestión comercial end-to-end de una distribuidora: inventario con trazabilidad de stock, flujo de ventas por estados, cobranzas, pagos a proveedores y licencias operativas. Incluye dashboard de métricas con amCharts y exportación de reportes en PDF. Stack Angular 11 + Node.js/Express + MySQL.",
  "PROJECT_OILGROUP_KPI_1": "Ambientes CI/CD",
  "PROJECT_OILGROUP_KPI_2": "módulos de negocio",
  "PROJECT_ANGULARJSONFORM_TITLE": "Librería Angular open source",
  "PROJECT_ANGULARJSONFORM_SUBTITLE": "Formularios dinámicos desde configuración JSON",
  "PROJECT_ANGULARJSONFORM_DESC": "angular-json-form es una librería Angular publicada en npm que genera formularios dinámicos desde configuración JSON. Soporta 15 tipos de input, validaciones declarativas, reglas dinámicas entre campos, i18n trilingüe y theming configurable. Incluye app demo para adopción rápida. Stack Angular 13 + TypeScript + RxJS, empaquetada con ng-packagr y distribuida en npm (v1.4.6).",
  "PROJECT_ANGULARJSONFORM_KPI_1": "publicada en npm",
  "PROJECT_ANGULARJSONFORM_KPI_2": "Tipos de input",
  "PROJECT_ANGULARJSONFORM_KPI_3": "Idiomas i18n",
  "PROJECT_REPOSITORY": "Repositorio",
  "PROJECT_DEMO": "Demo",
  "CONTACT": "Links & Contacto"
}
