{
    "DEVELOPER": "Senior Fullstack Developer | Angular | Ionic | Node.js | Tech Lead",
    "EXPERIENCE": "Experiencia Profesional",
    "MENU_ABOUT_ME": "Sobre mí",
    "MENU_EXPERIENCE": "Experiencia",
    "MENU_SKILLS": "Skills",
    "MENU_CONTACT": "Contacto",
    "CESLA_TECH_LEAD": "Tech Lead / Desarrollador Full Stack",
    "CESLA_TECH_LEAD_PERIOD": "Nov 2024 – Feb 2026",
    "CESLA_TECH_LEAD_DESC": "Liderazgo técnico y estratégico de múltiples aplicaciones críticas del sector de seguridad industrial, utilizadas por miles de usuarios en diversas empresas, coordinando la evolución tecnológica, modernización de arquitectura y estabilidad operativa de la plataforma.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_1": "Liderazgo de un equipo full stack responsable del mantenimiento evolutivo y correctivo de aplicaciones críticas.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_2": "Definición de estrategia técnica, priorización de iniciativas y coordinación con áreas de Soporte, QA, Implementación y DevSecOps.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_3": "Migración de infraestructura de almacenamiento desde Azure Blob Storage hacia Cloudflare R2, optimizando costos y arquitectura.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_4": "Modernización tecnológica mediante migración de Ionic 3 a Ionic 8, incluyendo refactorización de código y actualización de dependencias.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_5": "Implementación y automatización de pipelines CI/CD para aplicaciones web y móviles.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_6": "Automatización de procesos de build y distribución mediante Firebase App Distribution y publicación en Google Play y Apple App Store.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_7": "Supervisión de calidad de código, seguridad y performance mediante code reviews, gestión de dependencias y control de vulnerabilidades.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_8": "Análisis de incidentes en producción, identificación de causas raíz (RCA) y definición de planes de mejora continua.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_9": "Estandarización de procesos técnicos y documentación para auditorías internas y externas.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_10": "Participación activa en decisiones de arquitectura y evolución tecnológica de la plataforma.",
    "CESLA_TECH_LEAD_RESULT_1": "95 % de disponibilidad en producción sostenida en sistemas críticos.",
    "CESLA_TECH_LEAD_RESULT_2": "Reducción del 50 % de incidentes recurrentes mediante mejoras estructurales y automatización.",
    "CESLA_TECH_LEAD_RESULT_3": "Evolución tecnológica progresiva sin interrupciones operativas.",
    "CESLA_TECH_LEAD_RESULT_4": "Incremento de la eficiencia del equipo mediante estandarización y CI/CD.",
    "CESLA_FULLSTACK": "Desarrollador Full Stack",
    "CESLA_FULLSTACK_PERIOD": "May 2021 – Nov 2024",
    "CESLA_FULLSTACK_DESC": "Desarrollo y evolución de aplicaciones web y móviles para el sector de seguridad industrial, utilizadas por miles de usuarios de múltiples empresas, participando activamente en decisiones técnicas y arquitectura de soluciones en entornos productivos críticos.",
    "CESLA_FULLSTACK_RESPONSIBILITY_1": "Desarrollo full stack de nuevas funcionalidades utilizando ReactJS, PHP y JavaScript.",
    "CESLA_FULLSTACK_RESPONSIBILITY_2": "Participación en la definición de arquitectura técnica y decisiones de diseño de soluciones.",
    "CESLA_FULLSTACK_RESPONSIBILITY_3": "Evolución y modernización de sistemas legacy existentes.",
    "CESLA_FULLSTACK_RESPONSIBILITY_4": "Desarrollo de 5 aplicaciones móviles híbridas con Ionic, incluyendo integración con plugins nativos para funcionalidades del dispositivo.",
    "CESLA_FULLSTACK_RESPONSIBILITY_5": "Implementación de arquitectura offline-first con sincronización de datos para operación en entornos sin conectividad.",
    "CESLA_FULLSTACK_RESPONSIBILITY_6": "Integración con APIs propias y de terceros, incluyendo diseño y consumo de servicios REST.",
    "CESLA_FULLSTACK_RESPONSIBILITY_7": "Gestión de almacenamiento de archivos mediante Azure Blob Storage.",
    "CESLA_FULLSTACK_RESPONSIBILITY_8": "Configuración y mantenimiento de builds y despliegues móviles para Android e iOS.",
    "CESLA_FULLSTACK_RESPONSIBILITY_9": "Resolución de incidentes en producción en sistemas de alta criticidad y uso intensivo.",
    "CESLA_FULLSTACK_RESPONSIBILITY_10": "Optimización de rendimiento, seguridad y calidad de código.",
    "CESLA_FULLSTACK_RESPONSIBILITY_11": "Participación activa en code reviews, buenas prácticas y metodologías ágiles (Scrum).",
    "APEX_FRONTEND": "Desarrollador Front-End",
    "APEX_FRONTEND_PERIOD": "Ene 2020 – Mar 2021",
    "APEX_FRONTEND_DESC": "Desarrollo y mantenimiento de la interfaz web de una plataforma de chatbot de atención al cliente utilizada por múltiples empresas, integrando servicios de inteligencia artificial para la gestión de flujos conversacionales y automatización de interacciones con usuarios en entornos de alta concurrencia.",
    "APEX_FRONTEND_RESPONSIBILITY_1": "Desarrollo de interfaces dinámicas utilizando AngularJS, JavaScript, HTML5 y CSS3.",
    "APEX_FRONTEND_RESPONSIBILITY_2": "Integración con APIs REST y servicios backend desplegados en AWS para consumo de funcionalidades de IA y gestión de conversaciones.",
    "APEX_FRONTEND_RESPONSIBILITY_3": "Implementación de flujos conversacionales configurables por cliente dentro de una arquitectura multi-tenant.",
    "APEX_FRONTEND_RESPONSIBILITY_4": "Optimización de rendimiento, usabilidad y compatibilidad cross-browser en aplicaciones con gran volumen de usuarios.",
    "APEX_FRONTEND_RESPONSIBILITY_5": "Participación en debugging, resolución de incidencias y mejora continua del producto.",
    "APEX_FRONTEND_RESPONSIBILITY_6": "Colaboración con equipos backend y DevOps para definición de contratos API y troubleshooting en entornos cloud.",
    "APEX_FRONTEND_RESPONSIBILITY_7": "Participación activa en code reviews y metodologías ágiles (Scrum).",
    "APEX_FRONTEND_RESPONSIBILITY_8": "Aplicación de buenas prácticas de desarrollo front-end y estándares de calidad de código.",
    "RESPONSIBILITIES": "Responsabilidades y logros",
    "RESULTS": "Resultados destacados",
    "SKILLS": "Habilidades Técnicas",
    "FRONTEND": "Frontend: Angular (v15+), React, TypeScript, JavaScript, HTML, CSS, TailwindCSS",
    "BACKEND": "Backend: Node.js, PHP, C#",
    "MOBILE": "Móvil: Flutter, Ionic",
    "CLOUD": "Cloud & DevOps: Azure (Pipelines, Release, Blob Storage, App Services), CI/CD, Cloudflare",
    "TOOLS": "Herramientas: Git, GitHub, Firebase, MySQL, Postman, Nginx, Portainer",
    "DEPLOY_MOBILE": "Despliegue Móvil: Google Play Store, Apple App Store",
    "METHODOLOGIES": "Metodologías: Scrum, Kanban",
    "LANGUAGES": "Idiomas: Español (Nativo), Portugués (Avanzado), Inglés (Básico)",
    "PROJECTS": "Proyectos",
    "PROJECT_1": "Proyecto 1",
    "PROJECT_1_DESC": "Descripción breve del proyecto.",
    "PROJECT_1_LINK": "Ver repositorio",
    "PROJECT_2": "Proyecto 2",
    "PROJECT_2_DESC": "Descripción breve del proyecto.",
    "PROJECT_2_LINK": "Ver repositorio",
    "CONTACT": "Links & Contacto"
}