{
  "EXPERIENCE": "Experiência Profissional",
  "MENU_ABOUT_ME": "Sobre mim",
  "MENU_EXPERIENCE": "Experiência",
  "MENU_PROJECTS": "Projetos",
  "MENU_CONTACT": "Contato",
  "HOME_SUBTITLE": "Desenvolvedor Full Stack Sênior • Tech Lead • Analista de Sistemas",
  "HOME_CONTACT": "Entre em contato",
  "HOME_DOWNLOAD_CV": "Baixar CV",
  "ABOUT": "Perfil Profissional",
  "ABOUT_DESC_1": "Desenvolvedor Full Stack com mais de 5 anos de experiência profissional e uma trajetória de desenvolvimento autodidata de mais de 10 anos por meio de projetos pessoais, no design, evolução e modernização de aplicações web e móveis críticas para múltiplas empresas e milhares de usuários. Orientado a resultados, com foco em qualidade de código, eficiência operacional e melhoria contínua.",
  "ABOUT_DESC_2": "Especialista em Angular (JS e 2+ até v20), React, Node.js, PHP, Ionic, Cloud (Azure e Cloudflare R2) e CI/CD, com histórico comprovado em migrações tecnológicas, modernização de sistemas legados e automação de deploy. Sólido domínio de MySQL e design/normalização de bancos de dados relacionais.",
  "ABOUT_DESC_3": "Liderança de equipes técnicas, definição de arquitetura, priorização de demandas e coordenação com DevOps, QA e suporte, garantindo alta disponibilidade (>95%) e redução de incidentes recorrentes (50%) em produção.",
  "ABOUT_DESC_4": "Formação acadêmica e idiomas: Analista de Sistemas graduado em 2020, com média acadêmica de 8/10. Idioma nativo espanhol, com domínio avançado de português orientado ao uso técnico profissional e nível intermediário de inglês.",
  "CESLA_TECH_LEAD": "Tech Lead / Desenvolvedor Full Stack",
  "CESLA_TECH_LEAD_PERIOD": "Nov 2024 – Fev 2026",
  "CESLA_TECH_LEAD_RESPONSIBILITY_1": "Liderei uma equipe full stack de 3 desenvolvedores na manutenção e evolução de 2 aplicações web, 5 apps móveis e 5 APIs, utilizadas por 40 clientes e milhares de usuários, garantindo disponibilidade sustentada >95%.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_2": "Defini estratégia técnica, priorização de iniciativas e coordenação cross-functional com DevOps, QA e Suporte, acelerando a resolução de incidentes e otimizando processos de entrega.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_3": "Projetei e executei a migração de armazenamento do Azure Blob Storage para o Cloudflare R2, obtendo redução de custos de tráfego em 50% sem impacto em produção.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_4": "Liderei a modernização tecnológica de apps móveis migrando do Ionic 3 para o Ionic 8, incluindo refatoração e atualização de dependências, melhorando a manutenibilidade e extensibilidade da plataforma.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_5": "Implementei pipelines CI/CD, reduzindo o tempo de deploy de até 1 hora para 5 minutos, aumentando a frequência de releases para 4–6 por mês.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_6": "Automatizei processos de build e distribuição no Firebase e nas stores, reduzindo o tempo de geração de builds de meio dia para 5 minutos e eliminando erros de configuração.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_7": "Supervisionei qualidade de código, segurança e performance por meio de code reviews e gestão de dependências, contribuindo para 50% menos incidentes recorrentes.",
  "CESLA_FULLSTACK": "Desenvolvedor Full Stack",
  "CESLA_FULLSTACK_PERIOD": "Mai 2021 – Nov 2024",
  "CESLA_FULLSTACK_RESPONSIBILITY_1": "Mantive e evolui funcionalidades full stack em ReactJS, PHP e JavaScript, entregando em média 10 features e correções por sprint de 2 semanas para 40 clientes e milhares de usuários.",
  "CESLA_FULLSTACK_RESPONSIBILITY_2": "Participei da definição de arquitetura técnica e design de soluções, otimizando a escalabilidade e manutenibilidade de sistemas legados e novos produtos.",
  "CESLA_FULLSTACK_RESPONSIBILITY_3": "Modernizei sistemas legados por meio de refatoração e modularização de componentes, obtendo redução de 60% no tamanho do código.",
  "CESLA_FULLSTACK_RESPONSIBILITY_4": "Mantive 5 aplicações móveis híbridas com Ionic, integrando plugins nativos e suporte Android/iOS, garantindo consistência entre dispositivos e ambientes.",
  "CESLA_FULLSTACK_RESPONSIBILITY_5": "Implementei arquitetura offline-first com sincronização de dados, permitindo operação contínua em ambientes sem conectividade.",
  "CESLA_FULLSTACK_RESPONSIBILITY_6": "Gerenciei armazenamento de arquivos no Azure Blob Storage, otimizando eficiência e reduzindo complexidade no acesso a dados.",
  "APEX_FRONTEND": "Desenvolvedor Front-End",
  "APEX_FRONTEND_PERIOD": "Jan 2020 – Mar 2021",
  "APEX_FRONTEND_RESPONSIBILITY_1": "Mantive interfaces dinâmicas com AngularJS, JavaScript, HTML5 e CSS3, garantindo experiência de usuário consistente e compatibilidade cross-browser em aplicações de alto volume.",
  "APEX_FRONTEND_RESPONSIBILITY_2": "Implementei fluxos conversacionais configuráveis por cliente dentro de uma arquitetura multi-tenant, permitindo adaptações rápidas e personalizadas para múltiplos clientes.",
  "APEX_FRONTEND_RESPONSIBILITY_3": "Colaborei em debugging e resolução de incidentes críticos, contribuindo para a estabilidade e continuidade operacional do produto.",
  "APEX_FRONTEND_RESPONSIBILITY_4": "Participei de code reviews e promovi boas práticas de desenvolvimento front-end, melhorando a qualidade do código e facilitando a evolução do produto.",
  "RESPONSIBILITIES": "Responsabilidades e conquistas",
  "PROJECTS": "Projetos pessoais",
  "PROJECT_NURA_TITLE": "Portfólio técnico multilíngue",
  "PROJECT_NURA_SUBTITLE": "Plataforma de posicionamento técnico",
  "PROJECT_NURA_DESC": "Nura é um portfólio técnico SPA desenvolvido em Angular 21 com arquitetura standalone (sem NgModule), internacionalização runtime em três idiomas (ES/EN/PT) e deploy estático automatizado no GitHub Pages. Centraliza perfil, experiência e projetos com acesso ao CV por idioma, voltado a recrutadores e clientes.",
  "PROJECT_NURA_KPI_1": "Idiomas i18n",
  "PROJECT_NURA_KPI_2": "Suítes de teste",
  "PROJECT_NURA_KPI_3": "Automações em CI/CD",
  "PROJECT_OCTOAUTODRIVE_TITLE": "Plataforma SaaS automotiva",
  "PROJECT_OCTOAUTODRIVE_SUBTITLE": "Gestão operacional multi-tenant full stack",
  "PROJECT_OCTOAUTODRIVE_DESC": "AutoDrive é uma plataforma SaaS multi-tenant para gestão operacional automotiva: inventário de veículos, publicação no Facebook, papéis e auditoria de alterações a nível de campo. Stack Angular 13 + Node.js/Express + MySQL, com integração de Cloudinary, Facebook Graph API e Gmail OAuth2. Frontend com lazy loading, i18n trilíngue e tempo real via Socket.IO.",
  "PROJECT_OCTOAUTODRIVE_KPI_1": "Módulos de API",
  "PROJECT_OCTOAUTODRIVE_KPI_2": "Integrações externas",
  "PROJECT_OCTOAUTODRIVE_KPI_3": "Idiomas i18n",
  "PROJECT_OILGROUP_TITLE": "Plataforma comercial de distribuição",
  "PROJECT_OILGROUP_SUBTITLE": "Gestão operacional full stack end-to-end",
  "PROJECT_OILGROUP_DESC": "OilGroup é uma plataforma para gestão comercial end-to-end de uma distribuidora: inventário com rastreabilidade de estoque, fluxo de vendas por estados, cobranças, pagamentos a fornecedores e licenças operacionais. Inclui dashboard de métricas com amCharts e exportação de relatórios em PDF. Stack Angular 11 + Node.js/Express + MySQL.",
  "PROJECT_OILGROUP_KPI_1": "Ambientes CI/CD",
  "PROJECT_OILGROUP_KPI_2": "Módulos de negócio",
  "PROJECT_ANGULARJSONFORM_TITLE": "Biblioteca Angular open source",
  "PROJECT_ANGULARJSONFORM_SUBTITLE": "Formulários dinâmicos a partir de configuração JSON",
  "PROJECT_ANGULARJSONFORM_DESC": "angular-json-form é uma biblioteca Angular publicada no npm que gera formulários dinâmicos a partir de configuração JSON. Suporta 15 tipos de input, validações declarativas, regras dinâmicas entre campos, i18n trilíngue e theming configurável. Inclui app demo para adoção rápida. Stack Angular 13 + TypeScript + RxJS, empacotada com ng-packagr e distribuída no npm (v1.4.6).",
  "PROJECT_ANGULARJSONFORM_KPI_1": "publicada no npm",
  "PROJECT_ANGULARJSONFORM_KPI_2": "Tipos de input",
  "PROJECT_ANGULARJSONFORM_KPI_3": "Idiomas i18n",
  "PROJECT_REPOSITORY": "Repositório",
  "PROJECT_DEMO": "Demo",
  "CONTACT": "Links & Contato"
}
