{
    "DEVELOPER": "Senior Fullstack Developer | Angular | Ionic | Node.js | Tech Lead",
    "EXPERIENCE": "Experiência Profissional",
    "MENU_ABOUT_ME": "Sobre mim",
    "MENU_EXPERIENCE": "Experiência",
    "MENU_SKILLS": "Skills",
    "MENU_CONTACT": "Contato",
    "CESLA_TECH_LEAD": "Tech Lead / Desenvolvedor Full Stack",
    "CESLA_TECH_LEAD_PERIOD": "Nov 2024 – Fev 2026",
    "CESLA_TECH_LEAD_DESC": "Liderança técnica e estratégica de múltiplas aplicações críticas no setor de segurança industrial, utilizadas por milhares de usuários em diversas empresas, coordenando a evolução tecnológica, a modernização da arquitetura e a estabilidade operacional da plataforma.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_1": "Liderança de uma equipe full stack responsável pela manutenção evolutiva e corretiva de aplicações críticas.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_2": "Definição de estratégia técnica, priorização de iniciativas e coordenação com áreas de Suporte, QA, Implementação e DevSecOps.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_3": "Migração de infraestrutura de armazenamento do Azure Blob Storage para Cloudflare R2, otimizando custos e arquitetura.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_4": "Modernização tecnológica por meio da migração de Ionic 3 para Ionic 8, incluindo refatoração de código e atualização de dependências.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_5": "Implementação e automação de pipelines CI/CD para aplicações web e móveis.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_6": "Automatização de processos de build e distribuição via Firebase App Distribution e publicação no Google Play e Apple App Store.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_7": "Supervisão da qualidade do código, segurança e performance por meio de code reviews, gestão de dependências e controle de vulnerabilidades.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_8": "Análise de incidentes em produção, identificação das causas raiz (RCA) e definição de planos de melhoria contínua.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_9": "Padronização de processos técnicos e documentação para auditorias internas e externas.",
    "CESLA_TECH_LEAD_RESPONSIBILITY_10": "Participação ativa em decisões de arquitetura e evolução tecnológica da plataforma.",
    "CESLA_TECH_LEAD_RESULT_1": "95% de disponibilidade em produção mantida em sistemas críticos.",
    "CESLA_TECH_LEAD_RESULT_2": "Redução de 50% em incidentes recorrentes por meio de melhorias estruturais e automação.",
    "CESLA_TECH_LEAD_RESULT_3": "Evolução tecnológica progressiva sem interrupções operacionais.",
    "CESLA_TECH_LEAD_RESULT_4": "Aumento da eficiência da equipe por meio de padronização e CI/CD.",
    "CESLA_FULLSTACK": "Desenvolvedor Full Stack",
    "CESLA_FULLSTACK_PERIOD": "Mai 2021 – Nov 2024",
    "CESLA_FULLSTACK_DESC": "Desenvolvimento e evolução de aplicações web e móveis para o setor de segurança industrial, utilizadas por milhares de usuários de diversas empresas, que participam ativamente das decisões técnicas e da arquitetura de soluções em ambientes críticos de produção.",
    "CESLA_FULLSTACK_RESPONSIBILITY_1": "Desenvolvimento full stack de novas funcionalidades utilizando ReactJS, PHP e JavaScript.",
    "CESLA_FULLSTACK_RESPONSIBILITY_2": "Participação na definição da arquitetura técnica e decisões de design de soluções.",
    "CESLA_FULLSTACK_RESPONSIBILITY_3": "Evolução e modernização de sistemas legados existentes.",
    "CESLA_FULLSTACK_RESPONSIBILITY_4": "Desenvolvimento de 5 aplicações móveis híbridas com Ionic, incluindo integração com plugins nativos para funcionalidades do dispositivo.",
    "CESLA_FULLSTACK_RESPONSIBILITY_5": "Implementação de arquitetura offline-first com sincronização de dados para operação em ambientes sem conectividade.",
    "CESLA_FULLSTACK_RESPONSIBILITY_6": "Integração com APIs próprias e de terceiros, incluindo design e consumo de serviços REST.",
    "CESLA_FULLSTACK_RESPONSIBILITY_7": "Gestão de armazenamento de arquivos via Azure Blob Storage.",
    "CESLA_FULLSTACK_RESPONSIBILITY_8": "Configuração e manutenção de builds e deploys móveis para Android e iOS.",
    "CESLA_FULLSTACK_RESPONSIBILITY_9": "Resolução de incidentes em produção em sistemas de alta criticidade e uso intensivo.",
    "CESLA_FULLSTACK_RESPONSIBILITY_10": "Otimização de desempenho, segurança e qualidade de código.",
    "CESLA_FULLSTACK_RESPONSIBILITY_11": "Participação ativa em code reviews, boas práticas e metodologias ágeis (Scrum).",
    "APEX_FRONTEND": "Apex America — Desenvolvedor Front-End",
    "APEX_FRONTEND_PERIOD": "Jan 2020 – Mar 2021",
    "APEX_FRONTEND_DESC": "Desenvolvimento e manutenção da interface web de uma plataforma de chatbot de atendimento ao cliente utilizada por diversas empresas, integrando serviços de inteligência artificial para a gestão de fluxos de conversação e automação de interações do usuário em ambientes de alta concorrência.",
    "APEX_FRONTEND_RESPONSIBILITY_1": "Desenvolvimento de interfaces dinâmicas utilizando AngularJS, JavaScript, HTML5 e CSS3.",
    "APEX_FRONTEND_RESPONSIBILITY_2": "Integração com APIs REST e serviços backend implantados na AWS para consumo de funcionalidades de IA e gerenciamento de conversas.",
    "APEX_FRONTEND_RESPONSIBILITY_3": "Implementação de fluxos conversacionais configuráveis pelo cliente dentro de uma arquitetura multi-tenant.",
    "APEX_FRONTEND_RESPONSIBILITY_4": "Otimização de desempenho, usabilidade e compatibilidade cross-browser em aplicações com alto volume de usuários.",
    "APEX_FRONTEND_RESPONSIBILITY_5": "Participação em debugging, resolução de incidentes e melhoria contínua do produto.",
    "APEX_FRONTEND_RESPONSIBILITY_6": "Colaboração com equipes de backend e DevOps para definição de contratos de API e troubleshooting em ambientes cloud.",
    "APEX_FRONTEND_RESPONSIBILITY_7": "Participação ativa em code reviews e metodologias ágeis (Scrum).",
    "APEX_FRONTEND_RESPONSIBILITY_8": "Aplicação de boas práticas de desenvolvimento front-end e padrões de qualidade de código.",
    "RESPONSIBILITIES": "Responsabilidades e conquistas",
    "RESULTS": "Resultados em destaque",
    "SKILLS": "Habilidades Técnicas",
    "FRONTEND": "Frontend: Angular (v15+), React, TypeScript, JavaScript, HTML, CSS, TailwindCSS",
    "BACKEND": "Backend: Node.js, PHP, C#",
    "MOBILE": "Móvel: Flutter, Ionic",
    "CLOUD": "Cloud & DevOps: Azure (Pipelines, Release, Blob Storage, App Services), CI/CD, Cloudflare",
    "TOOLS": "Ferramentas: Git, GitHub, Firebase, MySQL, Postman, Nginx, Portainer",
    "DEPLOY_MOBILE": "Implantação Móvel: Google Play Store, Apple App Store",
    "METHODOLOGIES": "Metodologias: Scrum, Kanban",
    "LANGUAGES": "Idiomas: Espanhol (Nativo), Português (Avançado), Inglês (Básico)",
    "PROJECTS": "Projetos",
    "PROJECT_1": "Projeto 1",
    "PROJECT_1_DESC": "Breve descrição do projeto.",
    "PROJECT_1_LINK": "Ver repositório",
    "PROJECT_2": "Projeto 2",
    "PROJECT_2_DESC": "Breve descrição do projeto.",
    "PROJECT_2_LINK": "Ver repositório",
    "CONTACT": "Links & Contato"
}