{
  "DEVELOPER": "Senior Fullstack Developer | Angular | Ionic | Node.js | Tech Lead",
  "EXPERIENCE": "Experiência Profissional",
  "MENU_ABOUT_ME": "Sobre mim",
  "MENU_EXPERIENCE": "Experiência",
  "MENU_SKILLS": "Skills",
  "MENU_CONTACT": "Contato",
  "ABOUT": "PERFIL PROFISSIONAL",
  "ABOUT_DESC": "Tech Lead e Desenvolvedor Full Stack com mais de 5 anos de experiência em design, evolução e modernização de aplicações web e móveis críticas para múltiplas empresas e milhares de usuários. Especialista em Angular (JS e 2+ até v20), React, Node.js, PHP, Ionic, Cloud (Azure e Cloudflare R2) e CI/CD, com histórico comprovado em migrações tecnológicas, modernização de sistemas legados e automação de deploys. Liderança de equipes técnicas, definição de arquitetura, priorização de demandas e coordenação com DevOps, QA e suporte, garantindo alta disponibilidade (>95%) e redução de incidentes recorrentes (50%) em produção. Orientado a resultados, com foco em qualidade de código, eficiência operacional e melhoria contínua.",
  "ABOUT_EDUCATION": "Formação acadêmica e idiomas: Analista de Sistemas, concluído em 2020, com média acadêmica de 8/10. Espanhol nativo, português avançado com uso técnico profissional e inglês básico.",
  "SKILLS": "Core Skills",
  "CESLA_TECH_LEAD": "Tech Lead / Desenvolvedor Full Stack",
  "CESLA_TECH_LEAD_PERIOD": "Nov 2024 – Fev 2026",
  "CESLA_TECH_LEAD_RESPONSIBILITY_1": "Liderei uma equipe full stack de 3 desenvolvedores na manutenção e evolução de 2 aplicações web, 5 apps móveis e 5 APIs, utilizadas por 40 clientes e milhares de usuários, garantindo disponibilidade contínua >95%.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_2": "Defini estratégia técnica, priorização de iniciativas e coordenação cross-functional com DevOps, QA e Suporte, acelerando a resolução de incidentes e otimizando processos de entrega.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_3": "Projetei e executei a migração de armazenamento do Azure Blob Storage para o Cloudflare R2, alcançando uma redução de 50% nos custos de tráfego sem impacto em produção.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_4": "Liderei a modernização tecnológica de aplicativos móveis, migrando do Ionic 3 para o Ionic 8, incluindo refatoração e atualização de dependências, melhorando a manutenibilidade e a extensibilidade da plataforma.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_5": "Implementei pipelines de CI/CD, reduzindo o tempo de deploy de até 1 hora para 5 minutos e aumentando a frequência de releases para 4–6 por mês.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_6": "Automatizei processos de build e distribuição no Firebase e nas stores, reduzindo o tempo de geração de builds de meio dia para 5 minutos e eliminando erros de configuração.",
  "CESLA_TECH_LEAD_RESPONSIBILITY_7": "Supervisionei a qualidade de código, segurança e performance por meio de code reviews e gestão de dependências, contribuindo para 50% menos incidentes recorrentes.",
  "CESLA_FULLSTACK": "Desenvolvedor Full Stack",
  "CESLA_FULLSTACK_PERIOD": "Mai 2021 – Nov 2024",
  "CESLA_FULLSTACK_RESPONSIBILITY_1": "Mantive e evoluí funcionalidades full stack em ReactJS, PHP e JavaScript, entregando em média 10 features e correções por sprint de 2 semanas para 40 clientes e milhares de usuários.",
  "CESLA_FULLSTACK_RESPONSIBILITY_2": "Participei da definição de arquitetura técnica e do design de soluções, otimizando a escalabilidade e a manutenibilidade de sistemas legados e novos produtos.",
  "CESLA_FULLSTACK_RESPONSIBILITY_3": "Modernizei sistemas legados por meio de refatoração e modularização de componentes, alcançando uma redução de 60% no tamanho do código.",
  "CESLA_FULLSTACK_RESPONSIBILITY_4": "Mantive 5 aplicações móveis híbridas com Ionic, integrando plugins nativos e suporte para Android/iOS, garantindo consistência entre dispositivos e ambientes.",
  "CESLA_FULLSTACK_RESPONSIBILITY_5": "Implementei uma arquitetura offline-first com sincronização de dados, permitindo operação contínua em ambientes sem conectividade.",
  "CESLA_FULLSTACK_RESPONSIBILITY_6": "Gerenciei o armazenamento de arquivos no Azure Blob Storage, otimizando a eficiência e reduzindo a complexidade no acesso aos dados.",
  "APEX_FRONTEND": "Apex America — Desenvolvedor Front-End",
  "APEX_FRONTEND_PERIOD": "Jan 2020 – Mar 2021",
  "APEX_FRONTEND_RESPONSIBILITY_1": "Mantive interfaces dinâmicas com AngularJS, JavaScript, HTML5 e CSS3, garantindo uma experiência de usuário consistente e compatibilidade cross-browser em aplicações de alto volume.",
  "APEX_FRONTEND_RESPONSIBILITY_2": "Integração com APIs REST e serviços backend implantados na AWS para consumo de funcionalidades de IA e gerenciamento de conversas.",
  "APEX_FRONTEND_RESPONSIBILITY_3": "Colaborei no debugging e na resolução de incidentes críticos, contribuindo para a estabilidade e continuidade operacional do produto.",
  "APEX_FRONTEND_RESPONSIBILITY_4": "Participei de code reviews e promovi boas práticas de desenvolvimento front-end, melhorando a qualidade do código e facilitando a evolução do produto.",
  "RESPONSIBILITIES": "Responsabilidades e conquistas",
  "PROJECTS": "Projetos pessoais",
  "PROJECT_REPOSITORY": "Repositorio",
  "CONTACT": "Links & Contato"
}
